In [3]:
# dependencies and setup
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sqlalchemy import create_engine
engine = create_engine('postgres://postgres:postgres@localhost:5432/EmployeeHW')
connection = engine.connect()

In [11]:
# create salaries df
employees_df = pd.read_sql("SELECT * FROM employees", connection)

# rename title column for consistency 
renamed_title_df = employees_df.rename(columns={"emp_title_id":"title_id"})

# show sample
renamed_title_df.head()

   emp_no title_id  birth_date  first_name  last_name sex   hire_date
0  473302    s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053    e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444    e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786    s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238    e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [13]:
# create salaries df
salaries_df = pd.read_sql("SELECT * FROM salaries", connection)

# merge salaries with employee data
emp_salary_df = pd.merge(salaries_df, renamed_title_df, on="emp_no", how="inner")

# show sample
emp_salary_df.head()

   emp_no  salary title_id  birth_date first_name last_name sex   hire_date
0   10001   60117    e0003  1953-09-02     Georgi   Facello   M  1986-06-26
1   10002   65828    s0001  1964-06-02    Bezalel    Simmel   F  1985-11-21
2   10003   40006    e0003  1959-12-03      Parto   Bamford   M  1986-08-28
3   10004   40054    e0003  1954-05-01  Chirstian   Koblick   M  1986-12-01
4   10005   78228    s0001  1955-01-21    Kyoichi  Maliniak   M  1989-09-12

In [15]:
# create titles df
titles_df = pd.read_sql("SELECT * FROM titles", connection)

# merge title name with employee data
complete_emp_df = pd.merge(emp_salary_df, titles_df, on="title_id", how="inner")

# show sample
complete_emp_df.head()

,emp_no,salary,title_id,birth_date,first_name,last_name,sex,hire_date,title
0,10001,60117,e0003,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer
1,10003,40006,e0003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer
2,10004,40054,e0003,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer
3,10006,40000,e0003,1953-04-20,Anneke,Preusig,F,1989-06-02,Senior Engineer
4,10009,60929,e0003,1952-04-19,Sumant,Peac,F,1985-02-18,Senior Engineer

In [16]:
# drop unnecessary columns
finished_df = complete_emp_df.drop(columns=["title_id", "birth_date", "first_name", "last_name", "sex", "hire_date"])

# drop rows with missing values
finished_df.dropna(how='any')

        emp_no  salary            title
0        10001   60117  Senior Engineer
1        10003   40006  Senior Engineer
2        10004   40054  Senior Engineer
3        10006   40000  Senior Engineer
4        10009   60929  Senior Engineer
...        ...     ...              ...
300019  111534   48077          Manager
300020  111692   40000          Manager
300021  111784   40000          Manager
300022  111877   53846          Manager
300023  111939   40000          Manager

[300024 rows x 3 columns]